function initialize() {
    var latlng = new google.maps.LatLng(35.4133262, 139.3931369);
    var opts = {
        zoom: 10,
        center: latlng,
        mapTypeId: google.maps.MapTypeId.ROADMAP
    };
    var map = new google.maps.Map(document.getElementById("map_canvas"), opts);

    var shops = [
        [35.336587, 139.489172, "ゲームインファンファン藤沢店"],
        [35.279244, 139.670867, "シルクハット横須賀中央"],
        [35.573545, 139.371057, "ムトス相模原店"],
        [35.4405, 139.365274, "ＧＡＭＥシルクハット本厚木"],
        [35.532194, 139.435839, "ＣＬＵＢＳＥＧＡ相模大野"],
        [35.554492, 139.646611, "イミグランデ日吉店３"],
        [35.439046, 139.361906, "パームトップス"],
        [35.365382, 139.360569, "アミューズメントランドYAZ平塚店"],
        [35.278294, 139.670041, "プラサカプコン横須賀店"],

        [35.362347, 139.35958, "ベネクス平塚店"],
        [35.602812, 139.619601, "ラウンドワン高津店"],
        [35.519845, 139.553493, "ナムコプラボ都筑店"],
        [35.464527, 139.619856, "フリーダム"],
        [35.555667, 139.411992, "イミグランデ相模原"],
        [35.531998, 139.637179, "ラウンドワン横浜綱島店"],
        [35.463929, 139.617996, "ラウンドワン横浜西口店"],
        [35.511989, 139.713771, "ベネクス川崎"],
        [35.536386, 139.632878, "クラブセガ綱島"],
        [35.448112, 139.343177, "神奈川レジャーランド厚木店"],
        [35.531472, 139.700354, "ＧＡＭＥシルクハット川崎ダイス"],
        [35.386069, 139.618888, "ＣＬＵＢＳＥＧＡ新杉田"],
        [35.278743, 139.194162, "小田原メトロポリス"],
        [35.538042, 139.741695, "ラウンドワン川崎大師店"],
        [35.519249, 139.584794, "ドラマ港北インター店"],
        [35.434999, 139.35785, "ミリアンパーク　ネクサス"],
        [35.491496, 139.454823, "イミグランデ大和店"],
        [35.526931, 139.693955, "ウェアハウス川崎九龍城"],
        [35.532821, 139.696199, "ｎａｍｃｏラゾーナ川崎店"],
        [35.464686, 139.619582, "タイトーステーション横浜西口五番街店"],
        [35.600521, 139.614506, "イミグランデ溝口店"],
        [35.597321, 139.337314, "アピナ橋本店"]
    ];

    for (var i = 0; i < shops.length; i++) {
        var m_latlng1 = new google.maps.LatLng(shops[i][0], shops[i][1]);
        var marker1 = new google.maps.Marker({
            position: m_latlng1,
            map: map,
            title: shops[i][2]
        });
    }
}